article/build-linux-kernel.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-12 Thu 19:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>构建 Linux 内核运行项目</title>
<meta name="author" content="Jinghui Hu" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">构建 Linux 内核运行项目</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5ce57e8">1. 下载内核源代码</a></li>
<li><a href="#org32255f8">2. 编译 busybox 工具</a></li>
<li><a href="#org27c467b">3. 构建根文件系统</a></li>
<li><a href="#orgf15c771">4. qemu 启动</a></li>
</ul>
</div>
</div>


<div id="outline-container-org5ce57e8" class="outline-2">
<h2 id="org5ce57e8"><span class="section-number-2">1.</span> 下载内核源代码</h2>
<div class="outline-text-2" id="text-1">
<p>
配置编译环境
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ffb86c;">export</span> <span style="color: #ffc9e8;">ARCH</span>=x86
make  x86_64_defconfig
</pre>
</div>

<p>
通过如下路径开启 ramdisk 选项
</p>
<div class="org-src-container">
<pre class="src src-sh">make menuconfig
</pre>
</div>
<pre class="example" id="orgd3d6b05">
General setup  ---&gt;
       ----&gt; [*] Initial RAM filesystem and RAM disk (initramfs/initrd) support
    Device Drivers  ---&gt;
       [*] Block devices  ---&gt;
               &lt;*&gt;   RAM block device support
               (65536) Default RAM disk size (kbytes)
</pre>

<p>
编译内核
</p>
<div class="org-src-container">
<pre class="src src-sh">make
</pre>
</div>

<p>
编译成功结果位于 arch/x86<sub>64</sub>/boot/bzImage
</p>
</div>
</div>

<div id="outline-container-org32255f8" class="outline-2">
<h2 id="org32255f8"><span class="section-number-2">2.</span> 编译 busybox 工具</h2>
<div class="outline-text-2" id="text-2">
<p>
下载 busybox 源码
</p>

<p>
开启静态链接编译选项
</p>
<div class="org-src-container">
<pre class="src src-sh">make menuconfig
</pre>
</div>
<pre class="example" id="orgb6d0a03">
Busybox Settings  ---&gt;
      Build Options  ---&gt;
            [*] Build BusyBox as a static binary (no shared libs)
</pre>

<p>
编译并安装
</p>
<div class="org-src-container">
<pre class="src src-sh">make &amp;&amp; make install
</pre>
</div>

<p>
busybox 编译后的一下配置
</p>
<pre class="example" id="org5cc9e5e">
# mkdir etc dev mnt
# mkdir -p proc sys tmp mnt
# mkdir -p etc/init.d/
# vim etc/fstab
proc  /proc     proc    defaults        0       0
tmpfs /tmp      tmpfs   defaults        0       0
sysfs /sys      sysfs   defaults        0       0
# vim etc/init.d/rcS
echo -e "Welcome to tinyLinux"
/bin/mount -a
echo -e "Remounting the root filesystem"
mount -o remount,rw /
mkdir -p /dev/pts
mount -t devpts devpts /dev/pts
echo /sbin/mdev &gt; /proc/sys/kernel/hotplug
mdev -s
# chmod 755 etc/init.d/rcS
# vim etc/inittab
::sysinit:/etc/init.d/rcS
::respawn:-/bin/sh
::askfirst:-/bin/sh
::ctrlaltdel:/bin/umount -a -r
# chmod 755 etc/inittab
# cd dev
# mknod console c 5 1
# mknod null c 1 3
# mknod tty1 c 4 1
</pre>
</div>
</div>

<div id="outline-container-org27c467b" class="outline-2">
<h2 id="org27c467b"><span class="section-number-2">3.</span> 构建根文件系统</h2>
<div class="outline-text-2" id="text-3">
<p>
构建思路
</p>
<ol class="org-ol">
<li>先制作一个空的镜像文件；</li>
<li>然后把此镜像文件格式化为 ext3 格式；</li>
<li>然后把此镜像文件挂载，并把根文件系统复制到挂载目录；</li>
<li>卸载该镜像文件。</li>
<li>打成 gzip 包</li>
</ol>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #6272a4;">#</span><span style="color: #6272a4;">!/bin/</span><span style="color: #ff79c6;">bash</span>
rm -rf rootfs.ext3
rm -rf fs
dd <span style="color: #ffc9e8;">if</span>=/dev/zero <span style="color: #ffc9e8;">of</span>=./rootfs.ext3 <span style="color: #ffc9e8;">bs</span>=1M <span style="color: #ffc9e8;">count</span>=32
mkfs.ext3 rootfs.ext3
mkdir fs
mount -o loop rootfs.ext3 ./fs
cp -rf ./_install/* ./fs
umount ./fs
gzip --best -c rootfs.ext3 &gt; rootfs.img.gz
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf15c771" class="outline-2">
<h2 id="orgf15c771"><span class="section-number-2">4.</span> qemu 启动</h2>
<div class="outline-text-2" id="text-4">
<p>
通过 qemu 启动
</p>
<div class="org-src-container">
<pre class="src src-sh">qemu-system-x86_64 <span style="color: #f1fa8c;">\</span>
  -kernel ./linux-4.9.229/arch/x86_64/boot/bzImage  <span style="color: #f1fa8c;">\</span>
  -initrd ./busybox-1.30.0/rootfs.img.gz   <span style="color: #f1fa8c;">\</span>
  -append <span style="color: #f1fa8c;">"root=/dev/ram init=/linuxrc"</span>  <span style="color: #f1fa8c;">\</span>
  -serial file:output.txt
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2023-10-12 Thu 19:33. Created by Jinghui Hu at 2023-10-12 Thu 19:20.</p>
</div>
</body>
</html>